# CircleLightShape Properties

---
The CircleLightShape type exposes the following members.
| Name| Description
---|---|---
| EmitDiameter|  The emit diameter.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from LightShape)
Top
#### Reference
CircleLightShape Class
Autodesk.Revit.DB.Lighting Namespace